src/cf/InformationRegisters/DataAreaExchangeTransportSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>DataAreaExchangeTransportSettings</Name>
			<Comment>Stores private exchange message transport settings for each data area.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>CorrespondentEndpoint</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MessagesQueueEndpoint</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DataExchangeDirectory</Name>
					<Comment>Relative path to the exchange directory on the server or on the local network.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Peer</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/DataAreasExchangeTransportSettings.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>DataAreasExchangeTransportSettings</Name>
			<Comment>Stores settings for the transport of exchange messages that are common to all data areas.</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>FILEDataExchangeDirectory</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FILECompressOutgoingMessageFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPCompressOutgoingMessageFile</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionMaximumAllowedMessageSize</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionPassiveConnection</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPUserConnection</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnection_Port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>FTPConnectionPath</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DefaultExchangeMessagesTransportKind</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ExchangeMessagesTransportTypes</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteFTPConnectionPassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>DeleteExchangeMessageArchivePassword</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>CorrespondentEndpoint</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.MessagesQueueEndpoint</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ExchangeMessagesTransportTypes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ExchangeMessagesTransportTypes</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>EMAIL</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FILE</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>COM</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>WSPassiveMode</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ExternalSystem</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/DataAreaExchangeTransportSettings/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//  
// 
// 
// 
///////////////////////////////////////////////////////////////////////////////////////////////////////

#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region Private

Function TransportSettings(Val Peer) Export
	
	If Not Common.SubsystemExists("CloudTechnology") Then
		Raise NStr("en = 'The manager of exchange message transport settings is not defined.';");
	EndIf;
	
	MessagesExchangeTransportSettingsRegisterName = "MessageExchangeTransportSettings";
	
	QueryText =
	"SELECT
	|	"""" AS FILEDataExchangeDirectory,
	|	"""" AS FTPConnectionPath,
	|	DataAreaTransportSettings.DataExchangeDirectory AS RelativeInformationExchangeDirectory,
	|	DataAreasTransportSettings.FILEDataExchangeDirectory AS FILECommonInformationExchangeDirectory,
	|	DataAreasTransportSettings.FILECompressOutgoingMessageFile,
	|	DataAreasTransportSettings.FTPConnectionPath AS FTPCommonInformationExchangeDirectory,
	|	DataAreasTransportSettings.FTPCompressOutgoingMessageFile,
	|	DataAreasTransportSettings.FTPConnectionMaxMessageSize,
	|	DataAreasTransportSettings.FTPConnectionPassiveConnection,
	|	DataAreasTransportSettings.FTPConnectionUser,
	|	DataAreasTransportSettings.FTPConnectionPort,
	|	DataAreasTransportSettings.DefaultExchangeMessagesTransportKind,
	|	DataAreasTransportSettings.CorrespondentEndpoint,
	|	TransportSettings.WebServiceAddress AS WSWebServiceURL,
	|	TransportSettings.UserName AS WSUserName,
	|	"""" AS WSCorrespondentDataArea,
	|	"""" AS WSCorrespondentEndpoint
	|FROM
	|	InformationRegister.DataAreaExchangeTransportSettings AS DataAreaTransportSettings
	|		LEFT JOIN InformationRegister.DataAreasExchangeTransportSettings AS DataAreasTransportSettings
	|		ON (DataAreasTransportSettings.CorrespondentEndpoint = DataAreaTransportSettings.CorrespondentEndpoint)
	|		LEFT JOIN #TransportSettingsTable AS TransportSettings
	|		ON (TransportSettings.Endpoint = DataAreaTransportSettings.CorrespondentEndpoint)
	|WHERE
	|	DataAreaTransportSettings.Peer = &Peer";
	QueryText = StrReplace(QueryText, "#TransportSettingsTable", "InformationRegister." + MessagesExchangeTransportSettingsRegisterName);
	
	Query = New Query(QueryText);
	Query.SetParameter("Peer", Peer);
	
	SetPrivilegedMode(True);
	QueryResult = Query.Execute();
	SetPrivilegedMode(False);
	
	If QueryResult.IsEmpty() Then
		Return Undefined;
	EndIf;
	
	Result = DataExchangeInternal.QueryResultToStructure(QueryResult);
	
	SetPrivilegedMode(True);
	Passwords = Common.ReadDataFromSecureStorage(Result.CorrespondentEndpoint,
		"FTPConnectionDataAreasPassword,WSPassword, ArchivePasswordDataAreaExchangeMessages", True);
	SetPrivilegedMode(False);
	
	Result.Insert("WSPassword", Passwords.WSPassword);
	Result.Insert("FTPConnectionPassword", Passwords.FTPConnectionDataAreasPassword);
	Result.Insert("ArchivePasswordExchangeMessages", Passwords.ArchivePasswordDataAreaExchangeMessages);
	
	Result.FILEDataExchangeDirectory = CommonClientServer.GetFullFileName(
		Result.FILECommonInformationExchangeDirectory,
		Result.RelativeInformationExchangeDirectory);
	
	Result.FTPConnectionPath = CommonClientServer.GetFullFileName(
		Result.FTPCommonInformationExchangeDirectory,
		Result.RelativeInformationExchangeDirectory);
	
	Result.Insert("UseTempDirectoryToSendAndReceiveMessages", True);
	
	If Result.DefaultExchangeMessagesTransportKind = Enums.ExchangeMessagesTransportTypes.FTP Then
		
		FTPParameters = DataExchangeServer.FTPServerNameAndPath(Result.FTPConnectionPath);
		
		Result.Insert("FTPServer", FTPParameters.Server);
		Result.Insert("FTPPath",   FTPParameters.Path);
		
	Else
		Result.Insert("FTPServer", "");
		Result.Insert("FTPPath",   "");
	EndIf;
	
	DataExchangeInternal.AddTransactionItemsCountToTransportSettings(Result);
	
	Return Result;
EndFunction

Function TransportSettingsWS(Val Peer) Export
	
	If Not Common.SubsystemExists("CloudTechnology") Then
		Raise NStr("en = 'The manager of exchange message transport settings is not defined.';");
	EndIf;
	
	MessagesExchangeTransportSettingsRegisterName = "MessageExchangeTransportSettings";
	
	Query = New Query(
	"SELECT
	|	DataAreaTransportSettings.CorrespondentEndpoint AS CorrespondentEndpoint
	|FROM
	|	InformationRegister.DataAreaExchangeTransportSettings AS DataAreaTransportSettings
	|WHERE
	|	DataAreaTransportSettings.Peer = &Peer");
	Query.SetParameter("Peer", Peer);
	
	Selection = Query.Execute().Select();
	Selection.Next();
	
	Endpoint = Selection.CorrespondentEndpoint;
	
	TransportSettingManager = Common.ObjectManagerByFullName("InformationRegister."
		+ MessagesExchangeTransportSettingsRegisterName);
	SettingsStructure_ = TransportSettingManager.TransportSettingsWS(Endpoint);
	
	If Not ValueIsFilled(SettingsStructure_.WSWebServiceURL) Then
		Raise StringFunctionsClientServer.SubstituteParametersToString(
			NStr("en = 'Peer infobase ""%1"" connection is not set up.';"),
			String(Peer));
	EndIf;
	
	Return SettingsStructure_;
	
EndFunction

// The procedure updates the register entry based on the passed structure values
//
Procedure UpdateRecord(RecordStructure) Export
	
	DataExchangeInternal.UpdateInformationRegisterRecord(RecordStructure, "DataAreaExchangeTransportSettings");
	
EndProcedure

#EndRegion

#EndIf
